package com.lab3.tanya;

public enum TokenType {
    /**
     * Пробелы
     */
    SPACES,
    /**
     * Целое число
     */
    NUMBER,
    /**
     * Символ '|'
     */
    OR,
    /**
     * Оператор '^'
     */
    XOR,
    /**
     * Оператор '*'
     */
    AND,
    /**
     * Оператор '!'
     */
    NOT,
    /**
     * Символ '('
     */
    LPAR,
    /**
     * Символ ')'
     */
    RPAR,
    /**
     * Переменная
     */
    VAR,
    /**
     * Приравнивание :=
     */
    ASSIGN,
    /**
     * Конец выражения ;
     */
    END
}
