package com.lab4.tanya;

public enum TokenType {
    /**
     * Пробелы
     */
    SPACES,
    /**
     * Целое число
     */
    NUMBER,
    /**
     * Символ '+'
     */
    ADD,
    /**
     * Символ '-'
     */
    SUB,
    /**
     * Символ '*'
     */
    MUL,
    /**
     * Символ '/'
     */
    DIV,
    /**
     * Символ '('
     */
    LPAR,
    /**
     * Символ ')'
     */
    RPAR,
    /**
     * Переменная
     */
    VAR,
    /**
     * Приравнивание :=
     */
    ASSIGN,
    /**
     * Конец выражения ;
     */
    END
}
